Repository: mmrm11/48764011D
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: For example, the above study indicated that three out of four females believe they are overweight, while only one out of four is obese.
es_es: Por ejemplo, el estudio anterior indica que tres de cuatro mujeres creen que tienen sobrepeso, mientras que solo una de cuatro tiene obesidad.

source: For girls, they would want to associate with media personalities, particularly those in television.
es_es: En el caso de las niñas, querrían asociarse con personalidades de los medios de comunicación, sobre todo de la televisión.

source: For instance, Disney production promotes the concept of ‘thin’ beauty (Northup & Liebler, 2010).
es_es: Por ejemplo, la producción de Disney promueve el concepto de la belleza "delgada" (Northup y Liebler, 2010).

source: For instance, Slade’s (1988, p.
es_es: Por ejemplo, la definición de Slade (1988, p.

source: For instance, a study conducted by Radar programs limited on Media Influence proved that more than one third of women and 25% of men keep to different kinds of diet at any given moment of time.
es_es: Por ejemplo, un estudio dirigido por los programas Radar limited on Media Influence demostró que más de un tercio de las mujeres y un 25% de los hombres siguen distintos tipos de dietas en un momento dado.

source: For instance, slimness is associated with beauty, whereas boldness is associated with primitiveness (Prabu, Natali, & German, 2009).
es_es: Por ejemplo, estar delgado se asocia con la belleza, mientras que la audacia se asocia más con lo primitivo (Prabu, Natali & German, 2009).

source: For instance, the mass media affects boys more as opposed to girls.
es_es: Por ejemplo, los medios de comunicación afectan más a los chicos que a las chicas.

source: For instance, they might start using harmful substances aimed at reducing body weights.
es_es: Por ejemplo, podrían empezar a consumir sustancias nocivas destinadas a reducir el peso corporal.

source: For those who follow the rules and regulations, they are rewarded while those going against are severely punished.
es_es: A los que siguen las normas y los reglamentos se les recompensa, mientras que a los que van en contra se les castiga severamente.

source: From a study conducted by Dohnt and Tiggermann (2006), one can say that the influence of parents is explicit regarding the children’s body image formation.
es_es: De un estudio realizado por Dohnt y Tiggermann (2006), se puede decir que la influencia de los padres es explícita en la formación de la imagen corporal de los niños.

source: From the above statement, the body image research, which emerged in the 1980s as a natural consequence of the growing interest in eating disorders, indicates the connection of many disorders cases with the body dissatisfaction.
es_es: A partir de la afirmación anterior, la investigación sobre la imagen corporal, que surgió en la década de 1980 como consecuencia natural del creciente interés por los trastornos alimentarios, indica la conexión de muchos casos de trastornos con la insatisfacción corporal.

source: From the above statistics, it can be observed that due to media influences, people possess inaccurate perceptions of their bodies.
es_es: Según las estadísticas anteriores, es posible observar que debido a la influencia de las redes sociales la gente obtiene una percepción equivocada de su cuerpo.

source: Further, at this age, adolescents start experiencing romantic relationships that promote precise attention to their body image and weight status.
es_es: Además, a esta edad los adolescentes comienzan a experimentar relaciones románticas que fomentan más atención a las condiciones de su imagen corporal y peso.

source: Girls vs. Boys
es_es: Chicas vs. Chicos

source: Girls would be interested in pleasing members of the opposite sex and would therefore explore all avenues to ensure that they are attractive (Lieberman, Doyle, & Markiewicz, 1999).
es_es: Las chicas estarían interesadas en agradar a los miembros del sexo opuesto y, por lo tanto, explorarían todas las vías para asegurarse de que son atractivas (Lieberman, Doyle y Markiewicz, 1999).

source: Girls would frequently consult such female relatives or friends pertaining to weight lose.
es_es: Las chicas consultan con frecuencia a sus familiares o amigas sobre la pérdida de peso.

source: Hayes and TantIeff-Dunn (2010) explained this trend by exploring children’s age development.
es_es: Hayes y TantIeff-Dunn (2010) explicaron esta tendencia explorando el desarrollo de la edad de los niños.

source: Hence, males have become obsessed with developing a muscular figure that often leads to health-threatening behaviors such as use of steroids, ephedrine, and dangerous diets (Cafri, 2004)
es_es: De ahí que los varones se hayan obsesionado con desarrollar una figura musculosa que a menudo conduce a comportamientos que ponen en peligro la salud, como el consumo de esteroides, efedrina y dietas peligrosas (Cafri, 2004).

source: However, 965 students involved in the study agreed that the main message perpetuated by media is the beauty of thinness in contrast to disgust of being overweight (Lawrie et al., 2006).
es_es: Sin embargo, 965 estudiantes que participaron en el estudio coincidieron en que el principal mensaje perpetuado por los medios de comunicación es la belleza de la delgadez en contraste con el asco que produce el sobrepeso (Lawrie et al., 2006).

source: However, beautiful characters are illustrated as objects of love, attraction, or sexual desire while smart or alternative girls are deprived of it.
es_es: Sin embargo, los personajes bellos se ilustran como objetos de amor, atracción o deseo sexual, mientras que las chicas inteligentes o alternativas se ven privadas de ello.

source: However, it is true that children rarely consult their friends over issues related to conflicts.
es_es: Sin embargo, es cierto que los niños rara vez consultan a sus amigos sobre cuestiones relacionadas con conflictos.

source: However, most of the works dedicated to the study of the body image and its impacts on children reveal that there is tendency where children aged of six years experience dissatisfaction as regards to their bodies.
es_es: Sin embargo, la mayoría de los trabajos dedicados al estudio de la imagen corporal y su impacto en los niños revelan que existe una tendencia a que los niños de seis años experimenten insatisfacción con respecto a su cuerpo.

source: However, recent research indicates that boys and men are increasingly likely to report body dissatisfaction (Ricciardelli, 2003), Cafri et al.
es_es: Sin embargo, investigaciones recientes indican que es cada vez más probable que los niños y los hombres manifiesten insatisfacción corporal (Ricciardelli, 2003), Cafri et al.

source: However, such weight-based distinction of female roles creates proper perception of body image and the role of physical attractiveness in women’s life.
es_es: Sin embargo, esta distinción de los roles femeninos basada en el peso crea una percepción adecuada de la imagen corporal y del papel del atractivo físico en la vida de las mujeres.

source: However, the main emphasis is paid to physical appearance as a formula for success, recognition, and health (Schutz, Paxton, & Wertheim, 2002)
es_es: Sin embargo, el énfasis principal se pone en la apariencia física como una fórmula de éxito, el reconocimiento y la salud (Schutz, Paxton & Wertheim, 2002).

source: However, the modeling process proposed by Bandura comprises steps covered by the contemporary media.
es_es: Sin embargo, el proceso de modelado propuesto por Bandura comprende pasos cubiertos por los medios de comunicación contemporáneos.

source: However, this positive accomplishment of the modern society in the context of female issues is degraded due to its close connection with beauty promotion.
es_es: Sin embargo, este logro positivo de la sociedad moderna en el contexto de las cuestiones femeninas se degrada debido a su estrecha relación con la promoción de la belleza.

source: However, this would be in line with what a female family member advices them to do as regards to weight lose.
es_es: Sin embargo, esto estaría en consonancia con lo que un miembro femenino de la familia les aconseja hacer en lo que respecta a la pérdida de peso.

source: If a mother develops a negative attitude towards a certain body size, the daughter would have to change the diet or use drugs in order to reduce the body size.
es_es: Si una madre desarrolla una actitud negativa hacia una determinada talla corporal, la hija tendría que cambiar la dieta o utilizar fármacos para reducir la talla corporal.

source: If given some drawings of girls showing various shapes, mothers would want their daughters to be close to the thinnest or emaciated drawings as opposed to the heavier or obese figures (Rutger, & Engels, 2009).
es_es: Si se les dieran algunos dibujos de niñas que mostraran diversas figuras, las madres querrán que sus hijas se acercaran a los dibujos más delgados o escuálidos en contraposición a las figuras más pesadas u obesas (Rutger, & Engels, 2009).

source: If their body images were perfect, they would encourage their children to emulate.
es_es: Si sus imágenes corporales fueran perfectas, animarían a sus hijos a emularlas.

source: In 1977, Albert Bandura suggested his Theory that has turned out to be one of the main studies in the framework of knowledge and growth.
es_es: En 1977, Albert Bandura propuso su Teoría, que ha resultado ser uno de los principales estudios en el marco del conocimiento y el crecimiento.

source: In 1999, Paxton, Schultz, Wertheim, and Muir had conducted a similar study on Australian high school girls.
es_es: En 1999, Paxton, Schultz, Wertheim y Muir realizaron un estudio similar con chicas de secundaria australianas.

source: In 2001, Lieberman, Gauvin, and Bukowski conducted an extensive study on Canadian students and postulated that peer pressure influenced peer related components such as peer mockery, attractiveness, and negative peer relationships.
es_es: En 2001, Lieberman, Gauvin y Bukowski llevaron a cabo un amplio estudio sobre estudiantes canadienses y postularon que la presión de grupo influía en los componentes relacionados con los compañeros, como la burla de los compañeros, el atractivo y las relaciones negativas con los compañeros.

source: In Japan, just like in other parts of the world, role models deliver messages to girls suggesting that thinness makes women attractive.
es_es: En Japón, al igual que en otras partes del mundo, los modelos de conducta transmiten a las niñas mensajes que sugieren que la delgadez hace atractivas a las mujeres.

source: In a study conducted in 1990s, it was established that same-sex relationships among peers influences the socialization of children as opposed to any other relationship.
es_es: En un estudio realizado en los años 90, se estableció que las relaciones entre iguales del mismo sexo influyen en la socialización de los niños más que cualquier otra relación.

source: In a study involving college students, the idea of social reinforcements and modeling could perhaps be employed to comprehend the sorority of children and reported cases of eating malfunctions.
es_es: En un estudio en el que participaron estudiantes universitarias, la idea de los refuerzos sociales y el modelado quizá podría emplearse para comprender la sororidad de los niños y los casos notificados de disfunciones alimentarias.

source: In addition to peers’ and parents’ influence, the contemporary media produce the substantial impact on children’s body image.
es_es: Además de la influencia de pares y padres, los medios de comunicación contemporáneos producen un impacto sustancial en la imagen corporal de los niños.

source: In addition to the beauty standards represented on television and advertising, video games produce a significant impact of children’s perception of body image.
es_es: Además de los cánones de belleza representados en la televisión y la publicidad, los videojuegos producen un impacto significativo en la percepción de la imagen corporal de los niños.

source: In addition, majority of the girls surveyed revealed the desire to look like women illustrated on TV and fashion magazines.
es_es: Además, la mayoría de las chicas encuestadas revelaron su deseo de parecerse a las mujeres que aparecen en la televisión y en las revistas de moda.

source: In advertising pauses, children get another portion of information speculating on physical beauty and sexuality.
es_es: En las pausas publicitarias, los niños reciben otra porción de información que especula sobre la belleza física y la sexualidad.

source: In an attempt to achieve body proportions as those promoted by media culture, girls try their best to perform physical exercises and check on their diet.
es_es: En un intwnto de lograr las proporciones corporales como promueve la cultura mediática, las chicas tratan de realizar ejercicio físico y controlar su dieta.

source: In contrast to the radio providing sound perception of music, television is filled with physical visions of modern singers.
es_es: En contraste con la radio, que proporciona una percepción sonora de la música, la televisión está llena de visiones físicas de cantantes de hoy en día.

source: In its turn, television content is highly varied; there are different shows, films, programs, video games, and many more.
es_es: A su vez, el contenido televisivo es muy variado; existen diferentes espectáculos, películas, programas, videojuegos y muchos más.

source: In modern media, thin females are used to glamorize different beauty products while average-sized women are employed to promote household product.
es_es: En los medios de comunicación modernos, las mujeres delgadas se utilizan para dar glamour a distintos productos de belleza, mientras que las de tamaño promedio se emplean para promocionar productos domésticos.

source: In most families of the world, preparation of food is the role of the mother (Richardson, & Rehr, 2001).
es_es: En la mayoría de las familias del mundo, la preparación de la comida es función de la madre (Richardson, & Rehr, 2001).

source: In one of the recent studies, 28.7% of people aged 20 to 24 of individuals are dissatisfied with their bodies (Markey, & Markey 2010).
es_es: En un estudio reciente, el 28,7% de personas entre los 20 y los 24 años están satisfechos con sus cuerpos. (Markey, & Markey 2010).

source: In other words, they value their thin body sizes in different capacities.
es_es: En otras palabras, valoran su delgadez corporal de forma diferente.

source: In particular, it is noted that children are influenced to adopt some of the behaviors that might be detrimental to their growth and development.
es_es: Particularmente se observa que los niños son influenciados a adoptar algunos comportamientos que pueden ser perjudicial para su propio crecimiento y desarrollo.

source: In society, the girl child is sensitive to the comments as opposed to boys.
es_es: En la sociedad, las niñas son más sensibles a los comentarios que los niños.

source: In the US, Kashubeck, Marchand-Martella, Neal, and Larsen (1997) analyzed the correlation between the need to be slim and the bulimic symptom among college students (Alta, Ludden, & Lally, 2007).
es_es: En EE.UU., Kashubeck, Marchand-Martella, Neal y Larsen (1997) analizaron la correlación entre la necesidad de estar delgada y el síntoma bulímico entre estudiantes universitarias (Alta, Ludden y Lally, 2007).

source: In the context of media influence on children, one may assert that positive attitude towards media content and personal desire to be and look like beloved media characters touch upon cognitive processes of children.
es_es: En el contexto de la influencia de las redes sociales en los niños, se puede afirmar que la actitud positiva hacia el contenido de los medios y el deseo personal de ser, y parecerse a los queridos personajes de los medios, influyen en los procesos cognitivos de los niños.

source: In the course of development, girls would develop a negative attitude towards fatness and would seem to be dissatisfied with their own bodies just in case they are fat.
es_es: A lo largo del desarrollo, las niñas desarrollarán una actitud negativa hacia la obesidad y estarán insatisfechas con su propio cuerpo por el mero hecho de estar gordas.

source: In the modern world filled with technology advancements like computers, game devices, and varied software, it is essential to consider the impact produced by video games on children’s behaviors and perception of body image.
es_es: En el mundo moderno lleno de avances tecnológicos como ordenadores, dispositivos de juego y softwares variados, es esencial considerar el impacto producido por los videojuegos en los comportamientos de los niños y en su percepción de la imagen corporal.

source: In the same way, such mothers would want their daughters to continue losing weight.
es_es: Del mismo modo, esas madres querrán que sus hijas sigan adelgazando.

source: In the study, 69% of 548 surveyed preadolescent and adolescent females agree that media content has influenced their perception of ideal body image, and 47% declared the desire to lose weight after observing media beauty standards (Lopez-Guimera et al., 2010).
es_es: En el estudio, el 69% de las 548 mujeres preadolescentes y adolescentes encuestadas están de acuerdo en que el contenido de los medios de comunicación ha influido en su percepción de la imagen corporal ideal, y el 47% declaró el deseo de perder peso después de observar los estándares de belleza de los medios de comunicación (Lopez-Guimera et al., 2010).

source: In their attempt to imitate beauty ideals promoted by media, children exercise dieting and disordered eating.
es_es: En su intento de imitar los ideales de belleza promovidos por los medios de comunicación, los niños practican dietas y una alimentación desordenada.

source: In this article, the influence of media on the socialization of children will be discussed in detail.
es_es: En este artículo, la influencia de las redes sociales en la socialización los niños será tratado en detalle.

source: In this regard, overweight girls would always be criticized.
es_es: En este sentido, las chicas con sobrepeso siempre serían criticadas.

source: In this regard, the girl child would want to develop such a body since the mother highlighted its advantages.
es_es: En este sentido, la niña querrá desarrollar un cuerpo así, ya que la madre ha destacado sus ventajas.

source: In this regard, they would reject images of fat and obese women in favor of the slimmer images perceived to be role models.
es_es: En este sentido, rechazarían las imágenes de mujeres gordas y obesas en favor de las imágenes más delgadas percibidas como modelos a seguir.

source: Individuals possessing such virtues as honesty, kindness and obedience always get something considerable in return while characters experiencing malice, envy, or deception are punished.
es_es: Los individuos que poseen virtudes como la honradez, la bondad y la obediencia siempre obtienen algo considerable a cambio, mientras que los personajes que experimentan malicia, envidia o engaño son castigados.

source: Influence of the Peers
es_es: Influencia de los iguales

source: Information regarding the perfect body size is readily available in the mass media that is, both print and visual.
es_es: Los medios de comunicación, tanto impresos como visuales, ofrecen información sobre el tamaño perfecto del cuerpo.

source: Instead, the current tendency shows that females of different nationalities including Chinese, Japanese, Latin American, etc. tend to achieve the same body proportions as girls and women in media (Holmstrom, 2004).
es_es: Por el contrario, la tendencia actual muestra que las mujeres de distintas nacionalidades, incluidas las chinas, japonesas, latinoamericanas, etc., tienden a alcanzar las mismas proporciones corporales que las niñas y mujeres de los medios de comunicación (Holmstrom, 2004).

source: Introduction
es_es: Introducción

source: It can include both one’s own mental images and perceptions of his or her body as well as the feelings one
es_es: Esto puede estar incluido en ambas imagenes mentales y percepciones de su propio cuerpo más que sus sentimientos.

source: It is also concluded that self-assessment on physical appearance among children is an important feature as far as self-worth and psychological health are concerned.
es_es: También se concluye que la autovaloración del aspecto físico entre los niños es una característica importante en lo que respecta a la autoestima y la salud psicológica.

source: It is established that mothers have a strong influence to the lives of their daughters as compared to the mass media.
es_es: Está demostrado que las madres influyen más en la vida de sus hijas que los medios de comunicación.

source: It is established that the body sizes is the leading cause of dissatisfaction.
es_es: Está demostrado que las tallas del cuerpo son la principal causa de insatisfacción.

source: It is evident that mothers can help their children to develop a body image that is desirable in society.
es_es: Es evidente que las madres pueden ayudar a sus hijos a desarrollar una imagen corporal deseable en la sociedad.

source: It is hard to identify her natural beauty since her face is frequently covered with much distracting make-up accomplished by aggressive or detached conduct (Northup & Liebler, 2010).
es_es: Es difícil identificar su belleza natural, ya que a menudo lleva la cara cubierta con mucho maquillaje que distrae la atención, lo que se consigue con una conducta agresiva o distante (Northup & Liebler, 2010).

source: It is impossible to declare that media content should be concerned only in the context of negative influence on children and adults’ behavior.
es_es: Es imposible afirmar que el contenido de los medios de comunicación solo debe preocuparnos en el contexto de la influencia negativa del comportamiento de niños y adultos.

source: It is necessary to admit that television content is also filled with information degrading such behavioral traits as drunken driving, smoking, and poor nutritional habits.
es_es: Es necesario admitir que los contenidos televisivos también están repletos de información que degrada rasgos de comportamiento como la conducción bajo los efectos del alcohol, el tabaquismo y los malos hábitos nutricionales.

source: It is noted that parents play a critical role as regards to the intimate relationships of their children.
es_es: Se observa que los padres desempeñan un papel fundamental en lo que respecta a las relaciones íntimas de sus hijos.

source: It is obvious that media influence girls more.
es_es: Es evidente que los medios de comunicación influyen más en las chicas.

source: It is obvious that muscles are observed better on slim bodies with flat stomachs.
es_es: Está claro que los músculos están mejor vistos en cuerpos delgados con barrigas planas.

source: It is possible to conclude that characters and individuals illustrated by media provoke some behavioral norms possessed by children (Krahé, & Krause, 2010).
es_es: Es posible concluir que los personajes e individuos ilustrados por los medios de comunicación provoca algunas normas de comportamiento que poseen los niños (Krahé, & Krause, 2010).

source: It should be noted that scholars have not yet generated enough data regarding the effects of various socializing agents on the growth and development of children.
es_es: Hay que señalar que los estudiosos aún no han generado suficientes datos sobre los efectos de los distintos agentes socializadores en el crecimiento y el desarrollo de los niños.
